betaflight/betaflight/src/platform/GD32/sdio_gd32h7xx.c
    if(ResponseType == 1) {
        return CheckOCR_Response(Response_R1);
    } else if(ResponseType == 6) {
        if((Response_R1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO) {
            SD_CardRCA = Response_R1;
        }
        if((Response_R1 & SD_R6_GENERAL_UNKNOWN_ERROR) == SD_R6_GENERAL_UNKNOWN_ERROR) {
            return SD_GENERAL_UNKNOWN_ERROR;
        }
        if((Response_R1 & SD_R6_ILLEGAL_CMD) == SD_R6_ILLEGAL_CMD) {
            return SD_ILLEGAL_CMD;
        }
        if((Response_R1 & SD_R6_COM_CRC_FAILED) == SD_R6_COM_CRC_FAILED) {
            return SD_COM_CRC_FAILED;
        }
    }

    return SD_OK;
}

/*!
    \brief      Analyze the OCR response and return the appropriate error code
    \param[in]  Response_R1: OCR Response code
    \param[out] none
    \retval     SD Card error state
*/
static SD_Error_t CheckOCR_Response(uint32_t Response_R1)
{
    if((Response_R1 & SD_OCR_ERRORBITS)             == SD_ALLZERO)                  return SD_OK;
    if((Response_R1 & SD_OCR_ADDR_OUT_OF_RANGE)     == SD_OCR_ADDR_OUT_OF_RANGE)    return SD_ADDR_OUT_OF_RANGE;
    if((Response_R1 & SD_OCR_ADDR_MISALIGNED)       == SD_OCR_ADDR_MISALIGNED)      return SD_ADDR_MISALIGNED;
    if((Response_R1 & SD_OCR_BLOCK_LEN_ERR)         == SD_OCR_BLOCK_LEN_ERR)        return SD_BLOCK_LEN_ERR;
    if((Response_R1 & SD_OCR_ERASE_SEQ_ERR)         == SD_OCR_ERASE_SEQ_ERR)        return SD_ERASE_SEQ_ERR;
    if((Response_R1 & SD_OCR_BAD_ERASE_PARAM)       == SD_OCR_BAD_ERASE_PARAM)      return SD_BAD_ERASE_PARAM;
    if((Response_R1 & SD_OCR_WRITE_PROT_VIOLATION)  == SD_OCR_WRITE_PROT_VIOLATION) return SD_WRITE_PROT_VIOLATION;
    if((Response_R1 & SD_OCR_LOCK_UNLOCK_FAILED)    == SD_OCR_LOCK_UNLOCK_FAILED)   return SD_LOCK_UNLOCK_FAILED;
    if((Response_R1 & SD_OCR_COM_CRC_FAILED)        == SD_OCR_COM_CRC_FAILED)       return SD_COM_CRC_FAILED;
    if((Response_R1 & SD_OCR_ILLEGAL_CMD)           == SD_OCR_ILLEGAL_CMD)          return SD_ILLEGAL_CMD;
    if((Response_R1 & SD_OCR_CARD_ECC_FAILED)       == SD_OCR_CARD_ECC_FAILED)      return SD_CARD_ECC_FAILED;
    if((Response_R1 & SD_OCR_CC_ERROR)              == SD_OCR_CC_ERROR)             return SD_CC_ERROR;
    if((Response_R1 & SD_OCR_GENERAL_UNKNOWN_ERROR) == SD_OCR_GENERAL_UNKNOWN_ERROR)return SD_GENERAL_UNKNOWN_ERROR;
    if((Response_R1 & SD_OCR_STREAM_READ_UNDERRUN)  == SD_OCR_STREAM_READ_UNDERRUN) return SD_STREAM_READ_UNDERRUN;
    if((Response_R1 & SD_OCR_STREAM_WRITE_OVERRUN)  == SD_OCR_STREAM_WRITE_OVERRUN) return SD_STREAM_WRITE_OVERRUN;
    if((Response_R1 & SD_OCR_CID_CSD_OVERWRITE)     == SD_OCR_CID_CSD_OVERWRITE)    return SD_CID_CSD_OVERWRITE;
    if((Response_R1 & SD_OCR_WP_ERASE_SKIP)         == SD_OCR_WP_ERASE_SKIP)        return SD_WP_ERASE_SKIP;
    if((Response_R1 & SD_OCR_CARD_ECC_DISABLED)     == SD_OCR_CARD_ECC_DISABLED)    return SD_CARD_ECC_DISABLED;
    if((Response_R1 & SD_OCR_ERASE_RESET)           == SD_OCR_ERASE_RESET)          return SD_ERASE_RESET;
    if((Response_R1 & SD_OCR_AKE_SEQ_ERROR)         == SD_OCR_AKE_SEQ_ERROR)        return SD_AKE_SEQ_ERROR;

    return SD_OK;
}

/*!
    \brief      Get response from SD device
    \param[in]  none
    \param[out] pResponse: pointer to response buffer
    \retval     none
*/
static void SD_GetResponse(uint32_t* pResponse)
{
    pResponse[0] = SDIO_RESP0(SDIO);
    pResponse[1] = SDIO_RESP1(SDIO);
    pResponse[2] = SDIO_RESP2(SDIO);
    pResponse[3] = SDIO_RESP3(SDIO);
}

/*!
    \brief      initialize the card
    \param[in]  none
    \param[out] none
    \retval     none
    \note       BlockSize must be 512 bytes
*/
static SD_Error_t SD_InitializeCard(void)
{
    SD_Error_t ErrorState = SD_OK;

    if((SDIO_PWRCTL(SDIO) & SDIO_PWRCTL_PWRCTL) != 0)
    {
        if(SD_CardType != SD_SECURE_DIGITAL_IO) {
            // Send CMD2 ALL_SEND_CID
            if((ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_ALL_SEND_CID | SD_CMD_RESPONSE_LONG), 0, 2)) != SD_OK) {
                return ErrorState;
            }

            // Get Card identification number data
            SD_GetResponse(SD_Handle.CID);
        }

        if((SD_CardType == SD_STD_CAPACITY_V1_1)    || (SD_CardType == SD_STD_CAPACITY_V2_0) ||
           (SD_CardType == SD_SECURE_DIGITAL_IO_COMBO) || (SD_CardType == SD_HIGH_CAPACITY)) {
            // Send CMD3 SET_REL_ADDR with argument 0
            // SD Card publishes its RCA.
            if((ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_SET_REL_ADDR | SD_CMD_RESPONSE_SHORT), 0, 6)) != SD_OK) {
                return ErrorState;
            }
        }

        if(SD_CardType != SD_SECURE_DIGITAL_IO) {
            // Send CMD9 SEND_CSD with argument as card's RCA
            if((ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_SEND_CSD | SD_CMD_RESPONSE_LONG), SD_CardRCA, 2)) == SD_OK) {
                // Get Card Specific Data
                SD_GetResponse(SD_Handle.CSD);
            }
        }
    } else {
        ErrorState = SD_REQUEST_NOT_APPLICABLE;
    }

    return ErrorState;
}

/*!
    \brief      Reads block(s) from a specified address in a card. The Data transfer is managed by DMA mode
    \param[in]  ReadAddress: address from where data is to be read
    \param[in]  buffer: pointer to the buffer that will contain the received data
    \param[in]  BlockSize: SD card Data block size (must be 512 bytes)
    \param[in]  NumberOfBlocks: number of blocks to read
    \param[out] none
    \retval     SD Card error state
    \note       This API should be followed by the function SD_CheckOperation() to check the completion of the read process. BlockSize must be 512 bytes
*/
static void SD_StartBlockTransfert(uint32_t* pBuffer, uint32_t BlockSize, uint32_t NumberOfBlocks, uint8_t dir)
{
    SDIO_DATACTL(SDIO)                = 0;                                                                 // Initialize data control register
    SD_Handle.TransferComplete = 0;                                                                  // Initialize handle flags
    SD_Handle.TransferError    = SD_OK;
    SD_Handle.Operation        = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;         // Initialize SD Read operation
    SD_Handle.Operation       |= dir << 1;
    SDIO_INTEN(SDIO)                 = 0;
    if (dir == SDIO_DIR_RX) {
        SDIO_INTEN(SDIO)            |= (SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |                     // Enable transfer interrupts
                                      SDIO_INTEN_DTENDIE  | SDIO_INTEN_RXOREIE);
    } else {
        SDIO_INTEN(SDIO)            |= (SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |                     // Enable transfer interrupts
                                      SDIO_INTEN_DTENDIE  | SDIO_INTEN_TXUREIE);
    }
    sdio_idma_set(SDIO, SDIO_IDMA_SINGLE_BUFFER, (BlockSize >> 5));
    sdio_idma_buffer0_address_set(SDIO, (uint32_t)pBuffer);
    SDIO_IDMACTL(SDIO) |= SDIO_IDMACTL_IDMAEN;

