betaflight/betaflight/src/platform/GD32/sdio_gd32h7xx.c
}

/*!
    \brief      Writes block(s) to a specified address in a card. The Data transfer is managed by DMA mode
    \param[in]  WriteAddress: address from where data is to be read
    \param[in]  buffer: pointer to the buffer that will contain the data to transmit
    \param[in]  BlockSize: the SD card Data block size (must be 512 bytes)
    \param[in]  NumberOfBlocks: number of blocks to write
    \param[out] none
    \retval     SD Card error state
    \note       This API should be followed by the function SD_CheckOperation() to check the completion of the write process (by SD current status polling). BlockSize must be 512 bytes
*/
SD_Error_t SD_ReadBlocks_DMA(uint64_t ReadAddress, uint32_t *buffer, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t   CmdIndex;
    SD_Handle.RXCplt = 1;

    if (BlockSize != 512) {
        return SD_ERROR;
    }
    if ((uint32_t)buffer & 0x1F) {
        return SD_ADDR_MISALIGNED;
    }

    SD_Handle.TransferComplete = 0;
    if(SD_CardType != SD_HIGH_CAPACITY)
    {
        ReadAddress *= 512;
    }

    SD_StartBlockTransfert(buffer, BlockSize, NumberOfBlocks, SDIO_DIR_RX);

    // Configure the SD DPSM (Data Path State Machine)
    SD_DataTransferInit(SDIO, BlockSize * NumberOfBlocks, SD_DATABLOCK_SIZE_512B, true);

    // Set Block Size for Card
    ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_SET_BLOCKLEN | SD_CMD_RESPONSE_SHORT), BlockSize, 1);

    // Send CMD18 READ_MULT_BLOCK with argument data address
    // or send CMD17 READ_SINGLE_BLOCK depending on number of block
    uint8_t retries = 10;
    CmdIndex   = (NumberOfBlocks > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK;
    do {
            ErrorState = SD_TransmitCommand(SDIO, (CmdIndex | SD_CMD_RESPONSE_SHORT), (uint32_t)ReadAddress, 1);
            if (ErrorState != SD_OK && retries--) {
                ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_APP_CMD | SD_CMD_RESPONSE_SHORT), 0, 1);
            }
    } while (ErrorState != SD_OK && retries);

    if (ErrorState != SD_OK) {
            SD_Handle.RXCplt = 0;
            return ErrorState;
    }

    uint32_t transferStart = millis();
    while(0U == SD_Handle.TransferComplete) {
        if (millis() - transferStart > SD_TRANSFER_TIMEOUT_MS) {
            SD_Handle.TransferError = SD_DATA_TIMEOUT;
            SD_Handle.RXCplt = 0;
            return SD_DATA_TIMEOUT;
        }
    }

    // Update the SD transfer error in SD handle
    SD_Handle.TransferError = ErrorState;
    uint32_t alignedAddr = (uint32_t)buffer & ~0x1FU;
    SCB_InvalidateDCache_by_Addr((uint32_t*)alignedAddr,
        (int32_t)(NumberOfBlocks * BlockSize + ((uint32_t)buffer - alignedAddr)));

    return ErrorState;
}

/*!
    \brief      Writes block(s) to a specified address in a card. The Data transfer is managed by DMA mode
    \param[in]  WriteAddress: address from where data is to be read
    \param[in]  buffer: pointer to the buffer that will contain the data to transmit
    \param[in]  BlockSize: the SD card Data block size (must be 512 bytes)
    \param[in]  NumberOfBlocks: number of blocks to write
    \param[out] none
    \retval     SD Card error state
    \note       This API should be followed by the function SD_CheckOperation() to check the completion of the write process (by SD current status polling). BlockSize must be 512 bytes
*/
SD_Error_t SD_WriteBlocks_DMA(uint64_t WriteAddress, uint32_t *buffer, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t   CmdIndex;
    SD_Handle.TXCplt = 1;

    if (BlockSize != 512) {
        return SD_ERROR;
    }
    if ((uint32_t)buffer & 0x1F) {
        return SD_ADDR_MISALIGNED;
    }

    if(SD_CardType != SD_HIGH_CAPACITY)
    {
        WriteAddress *= 512;
    }


    // Check number of blocks command
    // Send CMD24 WRITE_SINGLE_BLOCK
    // Send CMD25 WRITE_MULT_BLOCK with argument data address
    CmdIndex = (NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK;

    // Set Block Size for Card
    uint8_t retries = 10;
    do {
            ErrorState = SD_TransmitCommand(SDIO, (CmdIndex | SD_CMD_RESPONSE_SHORT), (uint32_t)WriteAddress, 1);
            if (ErrorState != SD_OK && retries--) {
                ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_APP_CMD | SD_CMD_RESPONSE_SHORT), 0, 1);
            }
    } while(ErrorState != SD_OK && retries);

    if (ErrorState != SD_OK) {
            SD_Handle.TXCplt = 0;
            return ErrorState;
    }

    SCB_CleanDCache_by_Addr((uint32_t*)buffer, (int32_t)(NumberOfBlocks * BlockSize));
    SD_StartBlockTransfert(buffer, BlockSize, NumberOfBlocks, SDIO_DIR_TX);

    // Configure the SD DPSM (Data Path State Machine)
    SD_DataTransferInit(SDIO, BlockSize * NumberOfBlocks, SD_DATABLOCK_SIZE_512B, false);

    uint32_t transferStart = millis();
    while(0U == SD_Handle.TransferComplete) {
        if (millis() - transferStart > SD_TRANSFER_TIMEOUT_MS) {
            SD_Handle.TransferError = SD_DATA_TIMEOUT;
            SD_Handle.TXCplt = 0;
            return SD_DATA_TIMEOUT;
        }
    }

    SD_Handle.TransferError = ErrorState;

    return ErrorState;
}

SD_Error_t SD_CheckWrite(void)
{
    if (SD_Handle.TXCplt != 0) return SD_BUSY;
    return SD_OK;
}

SD_Error_t SD_CheckRead(void)
{
    if (SD_Handle.RXCplt != 0) return SD_BUSY;
    return SD_OK;
}

/*!
    \brief      Returns information about specific card, contains all SD card information
    \param[in]  none
    \param[out] none
    \retval     SD Card error state
*/
SD_Error_t SD_GetCardInfo(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t Temp = 0;

    // Byte 0
    Temp = (SD_Handle.CSD[0] & 0xFF000000) >> 24;
    SD_CardInfo.SD_csd.CSDStruct      = (uint8_t)((Temp & 0xC0) >> 6);
    SD_CardInfo.SD_csd.SysSpecVersion = (uint8_t)((Temp & 0x3C) >> 2);
    SD_CardInfo.SD_csd.Reserved1      = Temp & 0x03;

    // Byte 1
    Temp = (SD_Handle.CSD[0] & 0x00FF0000) >> 16;
    SD_CardInfo.SD_csd.TAAC = (uint8_t)Temp;

    // Byte 2
    Temp = (SD_Handle.CSD[0] & 0x0000FF00) >> 8;
    SD_CardInfo.SD_csd.NSAC = (uint8_t)Temp;

    // Byte 3
    Temp = SD_Handle.CSD[0] & 0x000000FF;
    SD_CardInfo.SD_csd.MaxBusClkFrec = (uint8_t)Temp;

