betaflight/betaflight/src/platform/GD32/sdio_gd32h7xx.c
            // Send ACMD51 SD_APP_SEND_SCR with argument as 0
            if((ErrorState = SD_TransmitCommand(SDIO, (SD_CMD_SD_APP_SEND_SCR | SD_CMD_RESPONSE_SHORT), 0, 1)) == SD_OK) {
                while((SDIO_STAT(SDIO) & (SDIO_STAT_RXORE | SDIO_STAT_DTCRCERR | SDIO_STAT_DTTMOUT | SDIO_STAT_DTBLKEND | SDIO_FLAG_DTEND)) == 0) {
                    if(((SDIO_STAT(SDIO) & SDIO_FLAG_RFE) == 0) && ((SDIO_STAT(SDIO) & SDIO_FLAG_DATSTA) != 0)) {
                        *(tempscr + Index) = SDIO_FIFO(SDIO);
                        Index++;
                    }
                }

                if     ((SDIO_STAT(SDIO) & SDIO_STAT_DTTMOUT) != 0) ErrorState = SD_DATA_TIMEOUT;
                else if((SDIO_STAT(SDIO) & SDIO_STAT_DTCRCERR) != 0) ErrorState = SD_DATA_CRC_FAIL;
                else if((SDIO_STAT(SDIO) & SDIO_STAT_RXORE)  != 0) ErrorState = SD_RX_OVERRUN;
                else
                {
                    *(pSCR + 1) = ((tempscr[0] & SD_0TO7BITS) << 24)  | ((tempscr[0] & SD_8TO15BITS) << 8) |
                                  ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

                    *(pSCR) = ((tempscr[1] & SD_0TO7BITS) << 24)  | ((tempscr[1] & SD_8TO15BITS) << 8) |
                              ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);
                }

            }
        }
    }

    return ErrorState;
}

void sdioInitialize(void)
{

}

bool SD_InitialiseHardware(dmaResource_t *dma)
{
    UNUSED(dma);
    uint32_t timeout = 0;

    // Select SDIO peripheral based on configuration
    sdio_periph = (sdioConfig()->device == SDIO_DEV_TO_CFG(SDIODEV_2)) ? SDIO1 : SDIO0;

    // Reset only the selected SDIO module
    if (sdio_periph == SDIO0) {
        RCU_AHB3RST |=  RCU_AHB3RST_SDIO0RST;
        delay(1);
        RCU_AHB3RST &= ~RCU_AHB3RST_SDIO0RST;
    } else {
        RCU_AHB2RST |=  RCU_AHB2RST_SDIO1RST;
        delay(1);
        RCU_AHB2RST &= ~RCU_AHB2RST_SDIO1RST;
    }
    delay(1);

    // Enable SDIO clock
    /* SDIO clock 200M */
    /* configure the pll1 input and output clock range */
    rcu_pll_input_output_clock_range_config(IDX_PLL1, RCU_PLL1RNG_4M_8M, RCU_PLL1VCO_192M_836M);
    /* configure the PLL1 clock: CK_PLL1P/CK_PLL1Q/CK_PLL1R = HXTAL_VALUE / 5 * 40 / 1 */
    rcu_pll1_config(5, 40, 1, 1, 1);
    /* enable PLL1R clock output */
    rcu_pll_clock_output_enable(RCU_PLL1R);
    /* enable PLL1 clock */
    rcu_osci_on(RCU_PLL1_CK);

    while(timeout < 0xFFFF && ERROR == rcu_osci_stab_wait(RCU_PLL1_CK)) {
        delay(1);
        timeout++;
    }
    if(timeout >= 0xFFFF) {
        return false; // PLL1 failed to stabilize
    }

    // Enable clock for the selected SDIO
    if (sdio_periph == SDIO0) {
        rcu_sdio_clock_config(IDX_SDIO0, RCU_SDIO0SRC_PLL1R);
        rcu_periph_clock_enable(RCU_SDIO0);
    } else {
        rcu_sdio_clock_config(IDX_SDIO1, RCU_SDIO1SRC_PLL1R);
        rcu_periph_clock_enable(RCU_SDIO1);
    }

    // Configure GPIO pins from sdioPinConfig (IOConfigGPIOAF enables port clocks automatically)
    uint8_t is4BitWidth = sdioConfig()->use4BitWidth;

    const IO_t d0  = IOGetByTag(sdioPinConfig()->D0Pin);
    const IO_t d1  = IOGetByTag(sdioPinConfig()->D1Pin);
    const IO_t d2  = IOGetByTag(sdioPinConfig()->D2Pin);
    const IO_t d3  = IOGetByTag(sdioPinConfig()->D3Pin);
    const IO_t clk = IOGetByTag(sdioPinConfig()->CKPin);
    const IO_t cmd = IOGetByTag(sdioPinConfig()->CMDPin);

    IOInit(d0, OWNER_SDCARD, 0);
    if (is4BitWidth) {
        IOInit(d1, OWNER_SDCARD, 0);
        IOInit(d2, OWNER_SDCARD, 0);
        IOInit(d3, OWNER_SDCARD, 0);
    }
    IOInit(clk, OWNER_SDCARD, 0);
    IOInit(cmd, OWNER_SDCARD, 0);

#define SDIO_DATA       IO_CONFIG(GPIO_MODE_AF, GPIO_OSPEED_100_220MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define SDIO_CMD        IO_CONFIG(GPIO_MODE_AF, GPIO_OSPEED_100_220MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define SDIO_CLK        IO_CONFIG(GPIO_MODE_AF, GPIO_OSPEED_100_220MHZ, GPIO_OTYPE_PP, GPIO_PUPD_NONE)

    IOConfigGPIOAF(d0, SDIO_DATA, GPIO_AF_12);

    if (is4BitWidth) {
        IOConfigGPIOAF(d1, SDIO_DATA, GPIO_AF_12);
        IOConfigGPIOAF(d2, SDIO_DATA, GPIO_AF_12);
        IOConfigGPIOAF(d3, SDIO_DATA, GPIO_AF_12);
    }

    IOConfigGPIOAF(clk, SDIO_CLK, GPIO_AF_12);
    IOConfigGPIOAF(cmd, SDIO_CMD, GPIO_AF_12);

    // NVIC configuration for selected SDIO interrupts
    if (sdio_periph == SDIO0) {
        nvic_irq_enable(SDIO0_IRQn, 2, 0);
    } else {
        nvic_irq_enable(SDIO1_IRQn, 2, 0);
    }

    return true;
}

bool SD_GetState(void)
{
    // Check SDCARD status
    if(SD_GetStatus() == SD_OK) return true;
    return false;
}

static SD_Error_t SD_DoInit(void)
{
    SD_Error_t errorState;
    uint32_t reg;

    // Initialize SDIO peripheral interface with default configuration for SD card initialization.
    reg = SDIO_CLKCTL(SDIO);
    reg &= ~CLKCTL_CLEAR_MASK;
    reg |= (uint32_t)SDIO_INIT_CLK_DIV;
    SDIO_CLKCTL(SDIO) = reg;

    // Identify card operating voltage.
    errorState = SD_PowerON();
    if (errorState != SD_OK) {
        return errorState;
    }

    // Initialize the present card and put them in idle state.
    errorState = SD_InitializeCard();
    if (errorState != SD_OK) {
        return errorState;
    }

    // Read CSD/CID MSD registers.
    errorState = SD_GetCardInfo();
    if (errorState != SD_OK) {
        return errorState;
    }

    // Select the Card - Send CMD7 SDIO_SEL_DESEL_CARD.
    errorState = SD_TransmitCommand(SDIO, (SD_CMD_SEL_DESEL_CARD | SD_CMD_RESPONSE_SHORT), SD_CardRCA, 1);
    // Configure SDIO peripheral interface.
    reg = SDIO_CLKCTL(SDIO);
    reg &= ~CLKCTL_CLEAR_MASK;
    reg |= (uint32_t) SD_CLK_DIV_TRANS_DSPEED;
    SDIO_CLKCTL(SDIO) = reg;

    // Configure SD Bus width.
    if (errorState == SD_OK) {
        // Enable wide operation.
        if (sdioConfig()->use4BitWidth) {
            errorState = SD_WideBusOperationConfig(SD_BUS_WIDE_4B);
        } else {
            errorState = SD_WideBusOperationConfig(SD_BUS_WIDE_1B);
        }
#ifdef SD_SPEED_HIGH
        /* change the clock to high speed , user according to the speed configuration */
        sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, SD_CLK_DIV_TRANS_HSPEED);
        sdio_hardware_clock_enable(SDIO);
#else
        /* change the clock to default speed , user according to the speed configuration */
        sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, SD_CLK_DIV_TRANS_DSPEED);
        sdio_hardware_clock_enable(SDIO);
#endif

