betaflight/betaflight/src/platform/GD32/sdio_gd32h7xx.c
    }

    return errorState;
}

SD_Error_t SD_Init(void)
{
    static bool sdInitAttempted = false;
    static SD_Error_t result = SD_ERROR;

    if (sdInitAttempted) {
        return result;
    }

    sdInitAttempted = true;

    result = SD_DoInit();

    return result;
}

/*!
    \brief      This function handles SD card interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void SDIO0_IRQHandler(void)
{
    // Check for SDIO interrupt flags
    if ((SDIO_STAT(SDIO) & SDIO_STAT_DTEND) != 0) {
        SDIO_INTC(SDIO) = SDIO_INTC_DTENDC;
        /* disable idma for idma transfer */
        SDIO_IDMACTL(SDIO) &= ~SDIO_IDMACTL_IDMAEN;

        SDIO_INTEN(SDIO) &= ~(SDIO_INT_DTCRCERR | SDIO_INT_DTTMOUT | SDIO_INT_DTEND |
                               SDIO_INT_TFH | SDIO_INT_RFH | SDIO_INT_TXURE | SDIO_INT_RXORE);
        SDIO_IDMACTL(SDIO) &= ~SDIO_CMDCTL_TREN;
        if ((SD_Handle.Operation & 0x02) == (SDIO_DIR_TX << 1)) {
            /* Transfer is complete */
            SD_Handle.TXCplt = 0;
            if ((SD_Handle.Operation & 0x01) == SD_MULTIPLE_BLOCK) {
                /* Send stop command in multiblock write */
                SD_TransmitCommand(SDIO, (SD_CMD_STOP_TRANSMISSION | SD_CMD_RESPONSE_SHORT), 0, 1);
            }
        } else {
            /* RX transfer is complete */
            SD_Handle.RXCplt = 0;
            if ((SD_Handle.Operation & 0x01) == SD_MULTIPLE_BLOCK) {
                /* Send stop command in multiblock read */
                SD_TransmitCommand(SDIO, (SD_CMD_STOP_TRANSMISSION | SD_CMD_RESPONSE_SHORT), 0, 1);
            }
        }

        SDIO_INTC(SDIO) = SDIO_MASK_DATA_FLAGS;
        SD_Handle.TransferComplete = 1;
        SD_Handle.TransferError = SD_OK;
    } else if( (SDIO_STAT(SDIO) & (SDIO_STAT_DTCRCERR | SDIO_STAT_DTTMOUT | SDIO_STAT_RXORE | SDIO_STAT_TXURE)) != 0) {

        if ((SDIO_STAT(SDIO) & SDIO_STAT_DTCRCERR) != 0)
            SD_Handle.TransferError = SD_DATA_CRC_FAIL;
        else if ((SDIO_STAT(SDIO) & SDIO_STAT_DTTMOUT) != 0)
            SD_Handle.TransferError = SD_DATA_TIMEOUT;
        else if ((SDIO_STAT(SDIO) & SDIO_STAT_RXORE) != 0)
            SD_Handle.TransferError = SD_RX_OVERRUN;
        else if ((SDIO_STAT(SDIO) & SDIO_STAT_TXURE) != 0)
            SD_Handle.TransferError = SD_TX_UNDERRUN;

        SDIO_INTC(SDIO) = SDIO_MASK_DATA_FLAGS;
        // Disable all SDIO peripheral interrupt sources
        SDIO_INTEN(SDIO) &= ~(SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |
                        SDIO_INTEN_DTENDIE | SDIO_INTEN_TFHIE | SDIO_INTEN_RFHIE | SDIO_INTEN_TXUREIE |
                        SDIO_INTEN_RXOREIE);
        SDIO_IDMACTL(SDIO) &= ~SDIO_CMDCTL_TREN;
        SDIO_DATACTL(SDIO) |= SDIO_DATACTL_FIFOREST;
        SDIO_DATACTL(SDIO) &= ~SDIO_DATACTL_FIFOREST;
        /* Send stop command to abort transfer on error */
        SD_TransmitCommand(SDIO, (SD_CMD_STOP_TRANSMISSION | SD_CMD_RESPONSE_SHORT), 0, 1);
        SDIO_INTC(SDIO) = SDIO_FLAG_DTABORT;
        SDIO_IDMACTL(SDIO) &= ~SDIO_IDMACTL_IDMAEN;

    } else if ((SDIO_STAT(SDIO) & SDIO_INT_FLAG_IDMAERR) != 0){
        SDIO_INTC(SDIO) = SDIO_INT_FLAG_IDMAERR;
        SD_Handle.TransferError = SD_DMA_ERROR;
        // Disable all SDIO peripheral interrupt sources
        SDIO_INTEN(SDIO) &= ~(SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |
                        SDIO_INTEN_DTENDIE | SDIO_INTEN_TFHIE | SDIO_INTEN_RFHIE | SDIO_INTEN_TXUREIE |
                        SDIO_INTEN_RXOREIE);
        SDIO_IDMACTL(SDIO) &= ~SDIO_CMDCTL_TREN;
        SDIO_DATACTL(SDIO) |= SDIO_DATACTL_FIFOREST;
        SDIO_DATACTL(SDIO) &= ~SDIO_DATACTL_FIFOREST;
        /* Send stop command to abort transfer on error */
        SD_TransmitCommand(SDIO, (SD_CMD_STOP_TRANSMISSION | SD_CMD_RESPONSE_SHORT), 0, 1);
        SDIO_INTC(SDIO) = SDIO_FLAG_DTABORT;
        SDIO_IDMACTL(SDIO) &= ~SDIO_IDMACTL_IDMAEN;

    }


}

void SDIO1_IRQHandler(void)
{
    SDIO0_IRQHandler();
}

#endif
